OpenNuvoton/M55M1BSP/Library/StdDriver/src/spi.c
/**************************************************************************//**
 * @file     spi.c
 * @version  V1.00
 * @brief    SPI driver source file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2022 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include "NuMicro.h"

/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup SPI_Driver SPI Driver
  @{
*/

/** @addtogroup SPI_EXPORTED_FUNCTIONS SPI Exported Functions
  @{
*/
#define SPI_CONFIG_TIMEOUT  (0x100000UL)

static uint32_t SPII2S_GetSourceClockFreq(const SPI_T *i2s);

static uint32_t SPI_IsValidModule(const SPI_T *spi)
{
    return ((spi == SPI0) || (spi == SPI1) ||
            (spi == SPI2) || (spi == SPI3)) ? 1 : 0;
}

static int32_t SPI_IsValidMasterSlave(uint32_t u32MasterSlave)
{
    return ((u32MasterSlave == SPI_MASTER) || (u32MasterSlave == SPI_SLAVE)) ? 1 : 0;
}

static int32_t SPI_IsValidMode(uint32_t u32SPIMode)
{
    return ((u32SPIMode == SPI_MODE_0) || (u32SPIMode == SPI_MODE_1) ||
            (u32SPIMode == SPI_MODE_2) || (u32SPIMode == SPI_MODE_3)) ? 1 : 0;
}

static int32_t SPI_WaitDisableReady(const SPI_T *spi)
{
    uint32_t u32Timeout = SPI_CONFIG_TIMEOUT;

    while (((spi->STATUS & SPI_STATUS_SPIENSTS_Msk) != 0UL) && (u32Timeout > 0UL))
    {
        u32Timeout--;
    }

    return (u32Timeout == 0UL) ? SPI_ERR_TIMEOUT : SPI_OK;
}

static int32_t SPI_EnterConfigMode(SPI_T *spi, uint32_t *pu32WasEnabled)
{
    if ((!SPI_IsValidModule(spi)) || (pu32WasEnabled == (uint32_t *)NULL))
    {
        return SPI_ERR_FAIL;
    }

    *pu32WasEnabled = spi->CTL & SPI_CTL_SPIEN_Msk;

    if (*pu32WasEnabled != 0UL)
    {
        spi->CTL &= ~SPI_CTL_SPIEN_Msk;
    }

    return SPI_WaitDisableReady(spi);
}

static void SPI_ExitConfigMode(SPI_T *spi, uint32_t u32WasEnabled)
{
    if (u32WasEnabled != 0UL)
    {
        spi->CTL |= SPI_CTL_SPIEN_Msk;
    }
}

/**
 * @brief Select PCLK as the clock source of SPI
 *
 * @return Actual frequency of SPI peripheral clock source.
 */
static void SPI_SetPCLKSrc(const SPI_T *spi)
{
    if (!SPI_IsValidModule(spi))
    {
        return;
    }

    /* Select PCLK as the clock source of SPI */
    if (spi == SPI0)
    {
        /* Set the peripheral clock rate to equal APB clock rate */
        CLK->SPISEL = (CLK->SPISEL & (~CLK_SPISEL_SPI0SEL_Msk)) | CLK_SPISEL_SPI0SEL_PCLK0;
    }
    else if (spi == SPI1)
    {
        /* Set the peripheral clock rate to equal APB clock rate */
        CLK->SPISEL = (CLK->SPISEL & (~CLK_SPISEL_SPI1SEL_Msk)) | CLK_SPISEL_SPI1SEL_PCLK2;
    }
    else if (spi == SPI2)
    {
        /* Set the peripheral clock rate to equal APB clock rate */
        CLK->SPISEL = (CLK->SPISEL & (~CLK_SPISEL_SPI2SEL_Msk)) | CLK_SPISEL_SPI2SEL_PCLK0;
    }
    else
    {
        /* Set the peripheral clock rate to equal APB clock rate */
        CLK->SPISEL = (CLK->SPISEL & (~CLK_SPISEL_SPI3SEL_Msk)) | CLK_SPISEL_SPI3SEL_PCLK2;
    }
}

/**
 * @brief Select PCLK as the clock source of SPI
 *
 * @return Actual frequency of SPI peripheral clock source.
 */
static uint32_t SPI_GetPCLKFreq(const SPI_T *spi)
{
    uint32_t u32RetValue = 0UL;

    if (!SPI_IsValidModule(spi))
    {
        return 0UL;
    }

    /* Select PCLK as the clock source of SPI */
    if (spi == SPI0)
    {
        /* Return slave peripheral clock rate */
        u32RetValue = CLK_GetPCLK0Freq();
    }
    else if (spi == SPI1)
    {
        /* Return slave peripheral clock rate */
        u32RetValue = CLK_GetPCLK2Freq();
    }
    else if (spi == SPI2)
    {
        /* Return slave peripheral clock rate */
        u32RetValue = CLK_GetPCLK0Freq();
    }
    else
    {
        /* Return slave peripheral clock rate */
        u32RetValue = CLK_GetPCLK2Freq();
    }

    return u32RetValue;
}

/**
 * @brief Check SPI Clock Source Frequency.
 *
 * @param spi       The pointer of the specified SPI module.
 * @return uint32_t Clock Frequency
 */
static uint32_t SPI_GetModuleClkSrcFreq(const SPI_T *spi)
{
    uint32_t u32SPIClkSrcSel = 0UL;
    uint32_t u32RetValue = 0UL;

    if (!SPI_IsValidModule(spi))
    {
        return 0UL;
    }

    /* Get SPI clock source selection */
    if (spi == SPI0)
    {
        u32SPIClkSrcSel = ((CLK->SPISEL & CLK_SPISEL_SPI0SEL_Msk) >> CLK_SPISEL_SPI0SEL_Pos);
    }
    else if (spi == SPI1)
    {
        u32SPIClkSrcSel = ((CLK->SPISEL & CLK_SPISEL_SPI1SEL_Msk) >> CLK_SPISEL_SPI1SEL_Pos);
    }
    else if (spi == SPI2)
    {
        u32SPIClkSrcSel = ((CLK->SPISEL & CLK_SPISEL_SPI2SEL_Msk) >> CLK_SPISEL_SPI2SEL_Pos);
    }
    else if (spi == SPI3)
    {
        u32SPIClkSrcSel = ((CLK->SPISEL & CLK_SPISEL_SPI3SEL_Msk) >> CLK_SPISEL_SPI3SEL_Pos);
    }
    else
    {
        u32SPIClkSrcSel = SPI_CLKSRC_HXT;
    }

    switch (u32SPIClkSrcSel)
    {
        case SPI_CLKSRC_PLL1:
            u32RetValue = (CLK_GetAPLL1ClockFreq() >> 1);   /* Clock source is PLL */
            break;

        case SPI_CLKSRC_PLL0:
            u32RetValue = (CLK_GetAPLL0ClockFreq() >> 1);   /* Clock source is PLL */
            break;

        case SPI_CLKSRC_PCLK:
            u32RetValue = SPI_GetPCLKFreq(spi);             /* Clock source is PCLK */
            break;

        case SPI_CLKSRC_HIRC:
            u32RetValue = __HIRC;                           /* Clock source is HIRC 12Mhz */
            break;

        case SPI_CLKSRC_HIRC48M:
            u32RetValue = __HIRC48M;                        /* Clock source is HIRC 48Mhz */
            break;

        case SPI_CLKSRC_HXT:
        default:
            u32RetValue = __HXT;                            /* Clock source is HXT */
            break;
    }

    return u32RetValue;
}

/**
  * @brief  This function make SPI module be ready to transfer.
  * @param[in]  spi The pointer of the specified SPI module.
  * @param[in]  u32MasterSlave Decides the SPI module is operating in master mode or in slave mode. (SPI_SLAVE, SPI_MASTER)
  * @param[in]  u32SPIMode Decides the transfer timing. (SPI_MODE_0, SPI_MODE_1, SPI_MODE_2, SPI_MODE_3)
  * @param[in]  u32DataWidth Decides the data width of a SPI transaction.
  * @param[in]  u32BusClock The expected frequency of SPI bus clock in Hz.
  * @return Actual frequency of SPI peripheral clock.
  * @details By default, the SPI transfer sequence is MSB first, the slave selection signal is active low and the automatic
  *          slave selection function is disabled.
  *          In Slave mode, the u32BusClock shall be 0 and the SPI clock divider setting will be 0.
  *          The actual clock rate may be different from the target SPI clock rate.
  *          For example, if the SPI source clock rate is 12 MHz and the target SPI bus clock rate is 7 MHz, the
  *          actual SPI clock rate will be 6MHz.
  * @note   If u32BusClock = 0, DIVIDER setting will be set to the maximum value.
  * @note   If u32BusClock >= system clock frequency, SPI peripheral clock source will be set to APB clock and DIVIDER will be set to 0.
  * @note   If u32BusClock >= SPI peripheral clock source, DIVIDER will be set to 0.
  * @note   In slave mode, the SPI peripheral clock rate will be equal to APB clock rate.
  */
uint32_t SPI_Open(SPI_T *spi, uint32_t u32MasterSlave, uint32_t u32SPIMode, uint32_t u32DataWidth, uint32_t u32BusClock)
{
    uint32_t u32RetValue = 0UL;

