OpenNuvoton/M55M1BSP/Library/StdDriver/src/spi.c
    if (!SPI_IsValidModule(spi) ||
            !SPI_IsValidMasterSlave(u32MasterSlave) ||
            !SPI_IsValidMode(u32SPIMode))
    {
        return 0UL;
    }

    /* Disable I2S mode */
    spi->I2SCTL &= ~SPI_I2SCTL_I2SEN_Msk;

    /* Default setting: slave selection signal is active low.
       In Master mode, disable the automatic slave selection function. */
    spi->SSCTL = SPI_SS_ACTIVE_LOW; /* full-register */

    /* Default setting: MSB first, disable unit transfer interrupt, SP_CYCLE = 0. */
    spi->CTL = (u32SPIMode) | (u32MasterSlave); /* full-register */
    SPI_SET_DATA_WIDTH(spi, u32DataWidth);

    if (u32MasterSlave == SPI_MASTER)
    {
        /* Set the bus clock for the SPI module and store the actual frequency in u32RetValue. */
        u32RetValue = SPI_SetBusClock(spi, u32BusClock);
    }
    else     /* For slave mode, force the SPI peripheral clock rate to equal APB clock rate. */
    {
        /* Force slave peripheral clock source back to PCLK. */
        SPI_SetPCLKSrc(spi);

        /* Set DIVIDER = 0 */
        spi->CLKDIV = 0UL;

        /* Select PCLK as the clock source of SPI */
        u32RetValue = SPI_GetPCLKFreq(spi);
    }

    spi->CTL |= SPI_CTL_SPIEN_Msk;

    return u32RetValue;
}

/**
  * @brief  Disable SPI controller.
  * @param[in]  spi The pointer of the specified SPI module.
  * @details This function will reset SPI controller.
  */
void SPI_Close(const SPI_T *spi)
{
    uint32_t u32RegLockLevel = SYS_IsRegLocked();

    if (!SPI_IsValidModule(spi))
    {
        return;
    }

    /* Unlock protected registers */
    if (u32RegLockLevel)
    {
        SYS_UnlockReg();
    }

    /* Reset SPI */
    if (spi == SPI0)
    {
        SYS->SPIRST |= SYS_SPIRST_SPI0RST_Msk;
        SYS->SPIRST &= ~SYS_SPIRST_SPI0RST_Msk;
    }
    else if (spi == SPI1)
    {
        SYS->SPIRST |= SYS_SPIRST_SPI1RST_Msk;
        SYS->SPIRST &= ~SYS_SPIRST_SPI1RST_Msk;
    }
    else if (spi == SPI2)
    {
        SYS->SPIRST |= SYS_SPIRST_SPI2RST_Msk;
        SYS->SPIRST &= ~SYS_SPIRST_SPI2RST_Msk;
    }
    else
    {
        SYS->SPIRST |= SYS_SPIRST_SPI3RST_Msk;
        SYS->SPIRST &= ~SYS_SPIRST_SPI3RST_Msk;
    }

    /* Lock protected registers */
    if (u32RegLockLevel)
    {
        SYS_LockReg();
    }
}

/**
  * @brief  Clear RX FIFO buffer.
  * @param[in]  spi The pointer of the specified SPI module.
  * @details This function will clear SPI RX FIFO buffer. The RXEMPTY (SPI_STATUS[8]) will be set to 1.
  */
void SPI_ClearRxFIFO(SPI_T *spi)
{
    if (!SPI_IsValidModule(spi))
    {
        return;
    }

    spi->FIFOCTL |= SPI_FIFOCTL_RXFBCLR_Msk;
}

/**
  * @brief  Clear TX FIFO buffer.
  * @param[in]  spi The pointer of the specified SPI module.
  * @details This function will clear SPI TX FIFO buffer. The TXEMPTY (SPI_STATUS[16]) will be set to 1.
  * @note The TX shift register will not be cleared.
  */
void SPI_ClearTxFIFO(SPI_T *spi)
{
    if (!SPI_IsValidModule(spi))
    {
        return;
    }

    spi->FIFOCTL |= SPI_FIFOCTL_TXFBCLR_Msk;
}

/**
  * @brief  Disable the automatic slave selection function.
  * @param[in]  spi The pointer of the specified SPI module.
  * @details This function will disable the automatic slave selection function and set slave selection signal to inactive state.
  */
void SPI_DisableAutoSS(SPI_T *spi)
{
    uint32_t u32WasEnabled = 0UL;

    if (SPI_EnterConfigMode(spi, &u32WasEnabled) != SPI_OK)
    {
        return;
    }

    spi->SSCTL &= ~(SPI_SSCTL_AUTOSS_Msk | SPI_SSCTL_SS_Msk);

    SPI_ExitConfigMode(spi, u32WasEnabled);
}

/**
  * @brief  Enable the automatic slave selection function.
  * @param[in]  spi The pointer of the specified SPI module.
  * @param[in]  u32SSPinMask Specifies slave selection pins. (SPI_SS)
  * @param[in]  u32ActiveLevel Specifies the active level of slave selection signal. (SPI_SS_ACTIVE_HIGH, SPI_SS_ACTIVE_LOW)
  * @details This function will enable the automatic slave selection function. Only available in Master mode.
  *          The slave selection pin and the active level will be set in this function.
  */
void SPI_EnableAutoSS(SPI_T *spi, uint32_t u32SSPinMask, uint32_t u32ActiveLevel)
{
    uint32_t u32WasEnabled = 0UL;
    uint32_t u32PinMask = (u32SSPinMask & SPI_SSCTL_SS_Msk);
    uint32_t u32ActLevel = (u32ActiveLevel & SPI_SSCTL_SSACTPOL_Msk);

    if (u32PinMask == 0UL)
    {
        return;
    }

    if (SPI_EnterConfigMode(spi, &u32WasEnabled) != SPI_OK)
    {
        return;
    }

    spi->SSCTL = (spi->SSCTL & (~(SPI_SSCTL_AUTOSS_Msk | SPI_SSCTL_SSACTPOL_Msk | SPI_SSCTL_SS_Msk))) |
                 (u32PinMask | u32ActLevel | SPI_SSCTL_AUTOSS_Msk);

    SPI_ExitConfigMode(spi, u32WasEnabled);
}

/**
  * @brief  Set the SPI bus clock.
  * @param[in]  spi The pointer of the specified SPI module.
  * @param[in]  u32BusClock The expected frequency of SPI bus clock in Hz.
  * @return Actual frequency of SPI bus clock.
  * @details This function is only available in Master mode. The actual clock rate may be different from the target SPI bus clock rate.
  *          For example, if the SPI source clock rate is 12 MHz and the target SPI bus clock rate is 7 MHz, the actual SPI bus clock
  *          rate will be 6 MHz.
  * @note   If u32BusClock = 0, DIVIDER setting will be set to the maximum value.
  * @note   If u32BusClock >= system clock frequency, SPI peripheral clock source will be set to APB clock and DIVIDER will be set to 0.
  * @note   If u32BusClock >= SPI peripheral clock source, DIVIDER will be set to 0.
  */
uint32_t SPI_SetBusClock(SPI_T *spi, uint32_t u32BusClock)
{
    uint32_t u32ClkSrc = 0UL;
    uint32_t u32HCLKFreq = 0UL;
    uint32_t u32RetValue = 0UL;
    uint32_t u32WasEnabled = 0UL;

    if (SPI_EnterConfigMode(spi, &u32WasEnabled) != SPI_OK)
    {
        return SPI_GetBusClock(spi);
    }

    /* Get system clock frequency */
    u32HCLKFreq = CLK_GetSCLKFreq();

    if (u32BusClock >= u32HCLKFreq)
    {
        /* Select PCLK as the clock source of SPI */
        SPI_SetPCLKSrc(spi);
    }

    /* Check clock source of SPI */
    u32ClkSrc = SPI_GetModuleClkSrcFreq(spi);

    if (u32BusClock >= u32HCLKFreq)
    {
        /* Set DIVIDER = 0 */
        spi->CLKDIV = 0UL;
        /* Return master peripheral clock rate */
        u32RetValue = u32ClkSrc;
    }
    else if (u32BusClock >= u32ClkSrc)
    {
        /* Set DIVIDER = 0 */
        spi->CLKDIV = 0UL;
        /* Return master peripheral clock rate */
        u32RetValue = u32ClkSrc;
    }
    else if (u32BusClock == 0U)
    {
        /* Set DIVIDER to the maximum value. f_spi = f_spi_clk_src / (DIVIDER + 1) */
        spi->CLKDIV = (spi->CLKDIV & ~SPI_CLKDIV_DIVIDER_Msk) | SPI_CLKDIV_DIVIDER_Msk;
        /* Return master peripheral clock rate */
        u32RetValue = (u32ClkSrc / ((SPI_CLKDIV_DIVIDER_Msk >> SPI_CLKDIV_DIVIDER_Pos) + 1U));
    }
    else
    {
        uint32_t u32Div = (uint32_t)((((uint64_t)u32ClkSrc + (uint64_t)u32BusClock - 1ULL) / (uint64_t)u32BusClock) - 1ULL);

        /* Ensure the selected SPI clock does not exceed the requested bus clock. */
        u32Div = ((u32Div > (SPI_CLKDIV_DIVIDER_Msk >> SPI_CLKDIV_DIVIDER_Pos)) ?
                  (SPI_CLKDIV_DIVIDER_Msk >> SPI_CLKDIV_DIVIDER_Pos) : u32Div);

        spi->CLKDIV = (spi->CLKDIV & ~(SPI_CLKDIV_DIVIDER_Msk)) | (u32Div << SPI_CLKDIV_DIVIDER_Pos);

        /* Return master peripheral clock rate */
        u32RetValue = (u32ClkSrc / (u32Div + 1U));
    }

    SPI_ExitConfigMode(spi, u32WasEnabled);

    return u32RetValue;
}

/**
  * @brief  Configure FIFO threshold setting.
  * @param[in]  spi The pointer of the specified SPI module.
  * @param[in]  u32TxThreshold Decides the TX FIFO threshold. It could be 0 ~ 3. If data width is 8~16 bits, it could be 0 ~ 7.
  * @param[in]  u32RxThreshold Decides the RX FIFO threshold. It could be 0 ~ 3. If data width is 8~16 bits, it could be 0 ~ 7.
  * @details Set TX FIFO threshold and RX FIFO threshold configurations.
  */
void SPI_SetFIFO(SPI_T *spi, uint32_t u32TxThreshold, uint32_t u32RxThreshold)
{
    uint32_t u32WasEnabled = 0UL;

    if (SPI_EnterConfigMode(spi, &u32WasEnabled) != SPI_OK)
    {
        return;
    }

