OpenNuvoton/M55M1BSP/Library/StdDriver/src/spi.c
    /* Check slave selection signal inactive interrupt flag */
    if ((u32Mask & SPI_SSINACT_INT_MASK) && ((u32Status & SPI_STATUS_SSINAIF_Msk) != 0UL))
    {
        u32IntFlag |= SPI_SSINACT_INT_MASK;
    }

    /* Check slave TX under run interrupt flag */
    if ((u32Mask & SPI_SLVUR_INT_MASK) && ((u32Status & SPI_STATUS_SLVURIF_Msk) != 0UL))
    {
        u32IntFlag |= SPI_SLVUR_INT_MASK;
    }

    /* Check slave bit count error interrupt flag */
    if ((u32Mask & SPI_SLVBE_INT_MASK) && ((u32Status & SPI_STATUS_SLVBEIF_Msk) != 0UL))
    {
        u32IntFlag |= SPI_SLVBE_INT_MASK;
    }

    /* Check slave TX underflow interrupt flag */
    if ((u32Mask & SPI_TXUF_INT_MASK) && ((u32Status & SPI_STATUS_TXUFIF_Msk) != 0UL))
    {
        u32IntFlag |= SPI_TXUF_INT_MASK;
    }

    /* Check TX threshold interrupt flag */
    if ((u32Mask & SPI_FIFO_TXTH_INT_MASK) && ((u32Status & SPI_STATUS_TXTHIF_Msk) != 0UL))
    {
        u32IntFlag |= SPI_FIFO_TXTH_INT_MASK;
    }

    /* Check RX threshold interrupt flag */
    if ((u32Mask & SPI_FIFO_RXTH_INT_MASK) && ((u32Status & SPI_STATUS_RXTHIF_Msk) != 0UL))
    {
        u32IntFlag |= SPI_FIFO_RXTH_INT_MASK;
    }

    /* Check RX overrun interrupt flag */
    if ((u32Mask & SPI_FIFO_RXOV_INT_MASK) && ((u32Status & SPI_STATUS_RXOVIF_Msk) != 0UL))
    {
        u32IntFlag |= SPI_FIFO_RXOV_INT_MASK;
    }

    /* Check RX time-out interrupt flag */
    if ((u32Mask & SPI_FIFO_RXTO_INT_MASK) && ((u32Status & SPI_STATUS_RXTOIF_Msk) != 0UL))
    {
        u32IntFlag |= SPI_FIFO_RXTO_INT_MASK;
    }

    return u32IntFlag;
}

/**
  * @brief  Clear interrupt flag.
  * @param[in]  spi The pointer of the specified SPI module.
  * @param[in]  u32Mask The combination of all related interrupt sources.
  *                     Each bit corresponds to a interrupt source.
  *                     This parameter decides which interrupt flags will be cleared. It could be the combination of:
  *                       - \ref SPI_UNIT_INT_MASK
  *                       - \ref SPI_SSACT_INT_MASK
  *                       - \ref SPI_SSINACT_INT_MASK
  *                       - \ref SPI_SLVUR_INT_MASK
  *                       - \ref SPI_SLVBE_INT_MASK
  *                       - \ref SPI_TXUF_INT_MASK
  *                       - \ref SPI_FIFO_RXOV_INT_MASK
  *                       - \ref SPI_FIFO_RXTO_INT_MASK
  *
  * @details Clear SPI related interrupt flags specified by u32Mask parameter.
  */
void SPI_ClearIntFlag(SPI_T *spi, uint32_t u32Mask)
{
    uint32_t u32ClearMask = 0UL;

    if (!SPI_IsValidModule(spi))
    {
        return;
    }

    if (u32Mask & SPI_UNIT_INT_MASK)
    {
        u32ClearMask |= SPI_STATUS_UNITIF_Msk; /* Clear unit transfer interrupt flag */
    }

    if (u32Mask & SPI_SSACT_INT_MASK)
    {
        u32ClearMask |= SPI_STATUS_SSACTIF_Msk; /* Clear slave selection signal active interrupt flag */
    }

    if (u32Mask & SPI_SSINACT_INT_MASK)
    {
        u32ClearMask |= SPI_STATUS_SSINAIF_Msk; /* Clear slave selection signal inactive interrupt flag */
    }

    if (u32Mask & SPI_SLVUR_INT_MASK)
    {
        u32ClearMask |= SPI_STATUS_SLVURIF_Msk; /* Clear slave TX under run interrupt flag */
    }

    if (u32Mask & SPI_SLVBE_INT_MASK)
    {
        u32ClearMask |= SPI_STATUS_SLVBEIF_Msk; /* Clear slave bit count error interrupt flag */
    }

    if (u32Mask & SPI_TXUF_INT_MASK)
    {
        u32ClearMask |= SPI_STATUS_TXUFIF_Msk; /* Clear slave TX underflow interrupt flag */
    }

    if (u32Mask & SPI_FIFO_RXOV_INT_MASK)
    {
        u32ClearMask |= SPI_STATUS_RXOVIF_Msk; /* Clear RX overrun interrupt flag */
    }

    if (u32Mask & SPI_FIFO_RXTO_INT_MASK)
    {
        u32ClearMask |= SPI_STATUS_RXTOIF_Msk; /* Clear RX time-out interrupt flag */
    }

    if (u32ClearMask != 0UL)
    {
        spi->STATUS = u32ClearMask;
    }
}

/**
  * @brief  Get SPI status.
  * @param[in]  spi The pointer of the specified SPI module.
  * @param[in]  u32Mask The combination of all related sources.
  *                     Each bit corresponds to a source.
  *                     This parameter decides which flags will be read. It is combination of:
  *                       - \ref SPI_BUSY_MASK
  *                       - \ref SPI_RX_EMPTY_MASK
  *                       - \ref SPI_RX_FULL_MASK
  *                       - \ref SPI_TX_EMPTY_MASK
  *                       - \ref SPI_TX_FULL_MASK
  *                       - \ref SPI_TXRX_RESET_MASK
  *                       - \ref SPI_SPIEN_STS_MASK
  *                       - \ref SPI_SSLINE_STS_MASK
  *
  * @return Flags of selected sources.
  * @details Get SPI related status specified by u32Mask parameter.
  */
uint32_t SPI_GetStatus(const SPI_T *spi, uint32_t u32Mask)
{
    uint32_t u32Flag = 0UL;
    uint32_t u32Status = 0UL;

    if (!SPI_IsValidModule(spi))
    {
        return 0UL;
    }

    u32Status = spi->STATUS;

    /* Check busy status */
    if ((u32Mask & SPI_BUSY_MASK) && ((u32Status & SPI_STATUS_BUSY_Msk) != 0UL))
    {
        u32Flag |= SPI_BUSY_MASK;
    }

    /* Check RX empty flag */
    if ((u32Mask & SPI_RX_EMPTY_MASK) && ((u32Status & SPI_STATUS_RXEMPTY_Msk) != 0UL))
    {
        u32Flag |= SPI_RX_EMPTY_MASK;
    }

    /* Check RX full flag */
    if ((u32Mask & SPI_RX_FULL_MASK) && ((u32Status & SPI_STATUS_RXFULL_Msk) != 0UL))
    {
        u32Flag |= SPI_RX_FULL_MASK;
    }

    /* Check TX empty flag */
    if ((u32Mask & SPI_TX_EMPTY_MASK) && ((u32Status & SPI_STATUS_TXEMPTY_Msk) != 0UL))
    {
        u32Flag |= SPI_TX_EMPTY_MASK;
    }

    /* Check TX full flag */
    if ((u32Mask & SPI_TX_FULL_MASK) && ((u32Status & SPI_STATUS_TXFULL_Msk) != 0UL))
    {
        u32Flag |= SPI_TX_FULL_MASK;
    }

    /* Check TX/RX reset flag */
    if ((u32Mask & SPI_TXRX_RESET_MASK) && ((u32Status & SPI_STATUS_TXRXRST_Msk) != 0UL))
    {
        u32Flag |= SPI_TXRX_RESET_MASK;
    }

    /* Check SPIEN flag */
    if ((u32Mask & SPI_SPIEN_STS_MASK) && ((u32Status & SPI_STATUS_SPIENSTS_Msk) != 0UL))
    {
        u32Flag |= SPI_SPIEN_STS_MASK;
    }

    /* Check SPIx_SS line status */
    if ((u32Mask & SPI_SSLINE_STS_MASK) && ((u32Status & SPI_STATUS_SSLINE_Msk) != 0UL))
    {
        u32Flag |= SPI_SSLINE_STS_MASK;
    }

    return u32Flag;
}

/**
  * @brief  Get SPI status2.
  * @param[in]  spi The pointer of the specified SPI module.
  * @param[in]  u32Mask The combination of all related sources.
  *                     Each bit corresponds to a source.
  *                     This parameter decides which flags will be read. It is combination of:
  *                       - \ref SPI_SLVBENUM_MASK
  *
  * @return Flags of selected sources.
  * @details Get SPI related status specified by u32Mask parameter.
  */
uint32_t SPI_GetStatus2(const SPI_T *spi, uint32_t u32Mask)
{
    uint32_t u32TmpStatus = 0UL;

    if (!SPI_IsValidModule(spi))
    {
        return 0UL;
    }

